SpenceKonde/DxCore/megaavr/extras/VariantTemplate.h
/*  (C) Spence Konde 2021 open source (LGPL2.1 see LICENSE.md).

 ###  #     # ####      ####   ###      # ####  ####      #  #  ###
#   # #     # #   #     #   # #   #    #  #   # #   #     #  # #   #          #
#####  #   #  ####      #   # #####   #   #   # ####      ####  ###  ### ###     ###
#   #   # #   #  #      #   # #   #  #    #   # #   #        # #   #     #  # #  #  #
#   #    #    #   #     ####  #   # #     ####  ####         #  ###      ###  #  #  #
=====================================================     ----------     #
example of a variant definition file with notes for variant              #
creators who might be making their own

List the part numbers (if applicable) or what board this variant supports.


*/
#ifndef Pins_Arduino_h
#define Pins_Arduino_h
#include <avr/pgmspace.h>
#include "timers.h"

#define EXAMPLE_48PIN_PINOUT // if your pin numbering or general mapping has changed
// define something like this so people can detect and react programmatically.

// NOW FOR PIN NUMBERS

/* There are a set of rules that MUST be followed when choosing the pin numbers.
      When those rules are not observed, malfunctions will occuur
 * These are constrained for reasons not immediately obvious.
 * These parts have an internanal logical order for the pins.
   * This pattern is constant on all non-tinyAVR parts
   * Serial ports most certainly assume that for each mux options, the pins are adjacent and in order
      Tx -> Rx -> XCK -> XDIR.
 * Thus ALL VARIANTS MUST FOLLOW THE RULES in order to function without further (hard) modification.
 * The numbering shall begin at PA0, with PIN_P0 = 0.
    * PIN_A0 and PIN_A1 must be included in the numbering, even if the board has a crystal or clock.
 * Subsequent pins in port A are numbered in order.
 * After a port is finished, Look to the next letter of the alphabet.
    Is there a port associated with that letter which has one or more pins on it?
 * If there are one or more pins on that port available, mark it down with the next number, as if it were a pin.
    * a 28-pin DB DOES get a PIN_PD0, because it has PD1-PD7.
    * a 28-pin DB does NOT get a PIN_PB0 - there are no pins on PORTB in that pincount.
 * After the phantom pin, if any at the start of the port (PC0 and PD0 are the potential phantoms.
 * A pin that is not pin 0 within a part is skipped and it's number used for the next pin that is present.
 * There is some flexibility:
    * If UPDI pin cannot be set to act as IO, it should not have a declared number - it's not a pin as far as the part is concerned.
    * If Reset, but not UPDI can ber set to act as I/O, you may choose to skip numbering it, and give it the last number.
    * If Reset and UPDI can both be set as I/O, they should be numbered consecutively. It is the option of the implementor whether
        these two pins, PF6 and PF7 should be locasted at at the end of the pin numbers, or at the end of PORTF (this is only different on 64-pin parts. )
 * No pins shalt be arbitrarily renumbered to make the pin numbers "more like an Uno" or for any other purpose.
      This depraved and barbarous practice has no place in modern society. In the bad old days, when peripherals on classic AVRs were strewn
      haphazard across ports, it was justifiable. That is not the case here. The pinout makes sense, and generally demonstrates that at least
      some of the team was of sound mind during the design process. Again this is a contrast to classic AVRs.
 * Regarding those above mentioned pins that get numberd but can't be used, see the pin array section below.
/*

        /*##  ### #   #  ###
        #   #  #  ##  # #
        ####   #  # # #  ###
        #      #  #  ##     #
        #     ### #   #  #*/

#define PIN_PA0 (0)
#define PIN_PA1 (1)
#define PIN_PA2 (2)
#define PIN_PA3 (3)
(snip)
#define PIN_PF5 (39)
#define PIN_PF6 (40) /* RESET can be used as an input via fuse setting. It poses no reprogramming challenges, and has no output drivers. */
/*      PIN_PF7 (41) UPDI pin not available for alternative functions */

        /*##   ##   ###  ###  ###  ###
        #   # #  # #      #  #    #
        ####  ####  ###   #  #     ###
        #   # #  #     #  #  #        #
        ####  #  # ####  ###  ###  #*/

#define PINS_COUNT                     41     // Last pin number +1
#define NUM_ANALOG_INPUTS              18
// #define NUM_RESERVED_PINS            0     // One might argue that PA0 and PA1 on a board that always uses a crystal count here.
// #define NUM_INTERNALLY_USED_PINS     0     // And if your board has pins that are hardwired to stuff and can't be otherwise used
//                                            // that's what these are.
// Autocalculated are :
// NUM_DIGITAL_PINS = PINS_COUNT - NUM_RESERVED_PINS
// TOTAL_FREE_OPINS = NUM_DIGITAL_PINS - NUM_INTERNALLY_USED_PINS
//
// Count of I2C and SPI pins will be defined as 2 and 3 but are not used in further calculations. What that is supposed to represent is ill-defined
// If you for some reason need to change any of this, define them here. Only ones not defined here get automatically set.
//
// I am on a crusade todrive from this world the scourge of acting like an analog pin is something other
// than a digital pin with ADC input caoability. Same goes for the I2C and SPI pins. That foolish analog pin
// naming causes so much confusion for new users
//
//  BUILTIN LEDS AND BUTTONS.
// Here we can override the default pin for the LED with a command line option or something opassed through boards.txt or platform.txt.
// These shall always be defined using PIN_Pxn notation.  A board (rather than generic chip) might not check if it was defined.
#if !defined(LED_BUILTIN)
  #define LED_BUILTIN                  PIN_PA7
#endif
/* Until the legacy attach interrupt has been completely obsoleted, leave this line in
 * EXTERNAL_NUM_INTERRUPTS: Count the number of ports on the part. The last port counts for the number of I/O pins in it.
 * All other ports count for 8.. */
#ifdef CORE_ATTACH_OLD
  #define EXTERNAL_NUM_INTERRUPTS        47
#endif

      /*   #  ###   ### ####   ###   ###
       ## ## #   # #    #   # #   # #
       # # # ##### #    ####  #   #  ###
       #   # #   # #    # #   #   #     #
       #   # #   #  ### #  #   ###   ##*/

/* THIS IS IMPORTANT - also often tricky */
/* These macros map between different pin-like-things. Any renumbering of pins or changes to mappings will impact these*/

/* An analog **channel** is the number corresponding to a pin that goes into the MUXPOS. Try to avoid ever working with these
 * because it is oh so easy to treat it like a pin, when it's not a pin. **NOR CAN CODE TELL THAT IT IS NOT A PIN**
 * An Analog Input or analog Channel Identifier is ADC_CH(channel number), or (channel number | 0x80). That way, the code can
 * tell that something is an analog input, not a pin. Most analog inputs are pins, but not all are.
 * Thankfully on the Dx and tinyAVR parts, there is enough similarity that these can be automatically defined in core_parts/core_devices
 * whidh are files holding information common to all or a large fraction of supported parts.
 */

#define digitalPinToAnalogInput(p)        (((p) > PIN_PC7 && (p) < PIN_PF0) ? ((p) - PIN_PD0) : ((p) < PIN_PF6 ? ((p) - 18) : NOT_A_PIN))
#define analogChannelToDigitalPin(p)      (((p) < 12) ? ((p) + PIN_PD0) : (((p) < 16 || p > 21) ? NOT_A_PIN : ((p) + PIN_PF0 - 16)))
#define analogInputToDigitalPin(p)                        analogChannelToDigitalPin((p) & 0x7F)
#define digitalOrAnalogPinToDigital(p)    (((p) & 0x80) ? analogChannelToDigitalPin((p) & 0x7f) : (((p)<=NUM_DIGITAL_PINS) ? (p) : NOT_A_PIN))
/* You need to have a macro to convert porrs to the pin number of the zero pin. */
#define portToPinZero(port)               (((port) < PF) ? (((port) * 8) - (((port) > 1) ? 2 : 0) : ((port) == PF ? PIN_PF0 : NOT_A_PIN))

// Timer pin swaps TCA mux is only the default on DxCore - if you change PORTMUX, the PWM will follow.
#define TCA0_PINS PORTMUX_TCA0_PORTC_gc     // TCA0 output on PD[0:5] by default, vbut just write the portmux to change it
#define TCA1_PINS 0x00                      // Same as TCA0; in this case only the PB and PG portmux options are available.
#define TCB0_PINS PORTMUX_TCB0_bm           // TCB0 output on PF4 instead of PA2 (default)
#define TCB1_PINS PORTMUX_TCB1_bm           // TCB1 output on PF5 instead of PA3 (default)
#define TCB2_PINS 0x00                      // TCB2 output on PC0 (default) instead of PB4
#define TCB3_PINS PORTMUX_TCB3_bm           // TCB3 output on PC1 instead of PB5 (default)
#define TCD0_PINS PORTMUX_TCD0_DEFAULT_gc   // Only default port option works!

#if defined(MILLIS_USE_TIMERB0)
  #define digitalPinHasPWMTCB(p) (((p) == PIN_PB4) || ((p) == PIN_PB5) || ((p) == PIN_PF5))
#elif defined(MILLIS_USE_TIMERB1)
  #define digitalPinHasPWMTCB(p) (((p) == PIN_PB4) || ((p) == PIN_PB5) || ((p) == PIN_PF4))
#elif defined(MILLIS_USE_TIMERB2)
  #define digitalPinHasPWMTCB(p) (((p) == PIN_PB5) || ((p) == PIN_PF4) || ((p) == PIN_PF5))
#elif defined(MILLIS_USE_TIMERB3)
  #define digitalPinHasPWMTCB(p) (((p) == PIN_PB4) || ((p) == PIN_PF4) || ((p) == PIN_PF5))
#else //no TCB's are used for millis
  #define digitalPinHasPWMTCB(p) (((p) == PIN_PB4) || ((p) == PIN_PB5) || ((p) == PIN_PF4) || ((p) == PIN_PF5))
#endif

/* Tell code where it should expect these waveform outputs would be pointed initially */
#define PIN_TCA0_WO0_INIT PIN_PC0
#define PIN_TCA1_WO0_INIT PIN_PB0
#define PIN_TCD0_WOA_INIT PIN_PA4


