SpenceKonde/DxCore/megaavr/extras/VariantTemplate.h
// USE_TIMERD0_PWM  defaults to 1 (on).
// If it is turned off, analogWrite and turnOffPWM will not work with TCD pins. This may be used to save flash, particularly on
// small flash parts where the type D timer will be taken over anyway. The savings can in excess of 0.5k

// You may define TIMERD0_CLOCK_SETTINGS and TIMERD_TOP_SETTING to configure these directly.
// * If TIMERD0_TOP_SETTING is 254 509, 1019, 2039, or 4079
//   * As long as USE_TIMERD0_PWM is not defined as 0, PWM will be enabled **RUNTIME DETECTION OF TCD TOP WILL BE DISABLED**
//   * If TIMERD0_CLOCK_SETTINGS is defined, it will be used, otherwise the default for that clock speed will be used.
// * If TIMERD0_TOP_SETTING is any other value, analogWrite-mediated PWM will not be available. Combining with USE_TIMERD0_PWM
//    is a compile error.
// * If TIMERD0_TOP_SETTING is not defined, and TIMERD0_CLOCK_SETTINGS is, runtime autodetect of TCD0 TOP will be used however:
//   * TCD0 will be initially set to TOP of 254/
//   * All supported TOP values will be tested for, regardless of system clock speed.
// * If USE_TIMERD0_PWM is set to 0, no configuration of TCD0 will be performed by the core. A future update that allowed it to
//    be used for other purposes would change that, of course.
//
// NO_GLITCH_TIMERD0 leaves pins connected to TCD0 until digitalWrite is called on them.
// This is desirable to get more responsive TCD pwm and avoid short glitches when switching between 0 or 255 and  other duty
// cycles. Costs some flash.
#define NO_GLITCH_TIMERD0

#define digitalPinHasPWM(p)               (digitalPinHasPWMTCB(p) || ((p) >= PIN_PA4 && (p) <= PIN_PC5))
/* The above macro is deprecated, and is only for compatibility, when digitalPinHasPWMNow() is not viable.


       /*###   ###  ####  ##### #   # #   # #   #
        #   # #   # #   #   #   ## ## #   #  # #
        ####  #   # ####    #   # # # #   #   #
        #     #   # #  #    #   #   # #   #  # #
        #      ###  #   #   #   #   #  ###  #   */

/* This section contains an enumeration of the pins that each peripheral can be set to use via portmux.
 * SPI pins must all be listed here, except the SS pin, which we recommend including. The includes SPI.h library, however,
 * does not support acting as SPI slave, and disables SS, so there is nothing special about that pin.
 * I2C pins must all be listed here **except** for dual mode ones, those are handled internally automatically when that is enabled.
 * All SPI portmux options available must be defined.
 * I2C portmux options should not be defined.
 *
 * Hardware serial port mux count is no longer defined here. List port mux options that have available pins,
 * If a mux is to be considered valid, ALL pins applying to it must be defined.
 *
 *
 * VARIANTS SHOULD NOT INCLUDE ANY OFF THESE SORT OF DEFINES:

#define HWSERIAL0                       &USART0
#define HWSERIAL0_DRE_VECTOR            USART0_DRE_vect
#define HWSERIAL0_DRE_VECTOR_NUM        USART0_DRE_vect_num
#define HWSERIAL0_RXC_VECTOR            USART0_RXC_vect
#define HWSERIAL0_MUX_COUNT             5





 */

#define SPI_INTERFACES_COUNT   1 /* Has to be 1 never 2, because the code from other authors and in widespread use will expect the second SPI interface
                                  to be named SPI1, which will collide with the struct from io headers.*/
#define NUM_HWSERIAL_PORTS     5

// List out everty available mapping for the SPI pins.
// All pins should be included. They should be omitted only if
// the pin does not physically exist on the part
// (or, preferably, defined as NOT_A_PIN)
// However if pins are forgotten, they are autodefined to NOT_A_PIN
// SPI 0
#define SPI_MUX                PORTMUX_SPI0_DEFAULT_gc
#define SPI_MUX_PINSWAP_1      PORTMUX_SPI0_ALT1_gc
#define PIN_SPI_MOSI           PIN_PA4
#define PIN_SPI_MISO           PIN_PA5
#define PIN_SPI_SCK            PIN_PA6
#define PIN_SPI_SS             PIN_PA7
#define PIN_SPI_MOSI_PINSWAP_1 PIN_PE0
#define PIN_SPI_MISO_PINSWAP_1 PIN_PE1
#define PIN_SPI_SCK_PINSWAP_1  PIN_PE2
#define PIN_SPI_SS_PINSWAP_1   PIN_PE3


// SPI 1
#define SPI1_MUX                (PORTMUX_SPI1_DEFAULT_gc)
#define SPI1_MUX_PINSWAP_1      (PORTMUX_SPI1_ALT1_gc)
#define PIN_SPI1_MOSI           PIN_PC0
#define PIN_SPI1_MISO           PIN_PC1
#define PIN_SPI1_SCK            PIN_PC2
#define PIN_SPI1_SS             PIN_PA3
#define PIN_SPI1_MOSI_PINSWAP_1 PIN_PC4
#define PIN_SPI1_MISO_PINSWAP_1 PIN_PC5
#define PIN_SPI1_SCK_PINSWAP_1  PIN_PC6
#define PIN_SPI1_SS_PINSWAP_1   PIN_PC7


/* Yes, pinswap1 is the same as default. You must still include it or people will not be allowed to swap to it.
 * The slave pins for dual mode are hadled internally to wire. */

// TWI 0
#define PIN_WIRE_SDA           PIN_PA2
#define PIN_WIRE_SCL           PIN_PA3
#define PIN_WIRE_SDA_PINSWAP_1 PIN_PA2
#define PIN_WIRE_SCL_PINSWAP_1 PIN_PA3
#define PIN_WIRE_SDA_PINSWAP_2 PIN_PC2
#define PIN_WIRE_SCL_PINSWAP_2 PIN_PC3


// TWI 1
#define PIN_WIRE1_SDA           PIN_PF2
#define PIN_WIRE1_SCL           PIN_PF3
#define PIN_WIRE1_SDA_PINSWAP_1 PIN_PF2
#define PIN_WIRE1_SCL_PINSWAP_1 PIN_PF3
#define PIN_WIRE1_SDA_PINSWAP_2 PIN_PB2
#define PIN_WIRE1_SCL_PINSWAP_2 PIN_PB3

/* All mux names must be defined in the form shown below. */
/* That includes NONE. It does not, however, include a
 mux option that is not usable because none of the pins are there */

// USART 0
#define HWSERIAL0_MUX                   PORTMUX_USART0_DEFAULT_gc
#define HWSERIAL0_MUX_PINSWAP_1         PORTMUX_USART0_ALT1_gc
#define HWSERIAL0_MUX_PINSWAP_NONE      PORTMUX_USART0_NONE_gc
#define PIN_HWSERIAL0_TX                PIN_PA0
#define PIN_HWSERIAL0_RX                PIN_PA1
#define PIN_HWSERIAL0_XCK               PIN_PA2
#define PIN_HWSERIAL0_XDIR              PIN_PA3
#define PIN_HWSERIAL0_TX_PINSWAP_1      PIN_PA4
#define PIN_HWSERIAL0_RX_PINSWAP_1      PIN_PA5
#define PIN_HWSERIAL0_XCK_PINSWAP_1     PIN_PA6
#define PIN_HWSERIAL0_XDIR_PINSWAP_1    PIN_PA7

// USART1
#define HWSERIAL1_MUX                   PORTMUX_USART1_DEFAULT_gc
#define HWSERIAL1_MUX_PINSWAP_1         PORTMUX_USART1_ALT1_gc
#define HWSERIAL1_MUX_PINSWAP_NONE      PORTMUX_USART1_NONE_gc
#define PIN_HWSERIAL1_TX                PIN_PC0
#define PIN_HWSERIAL1_RX                PIN_PC1
#define PIN_HWSERIAL1_XCK               PIN_PC2
#define PIN_HWSERIAL1_XDIR              PIN_PC3
#define PIN_HWSERIAL1_TX_PINSWAP_1      PIN_PC4
#define PIN_HWSERIAL1_RX_PINSWAP_1      PIN_PC5
#define PIN_HWSERIAL1_XCK_PINSWAP_1     PIN_PC6
#define PIN_HWSERIAL1_XDIR_PINSWAP_1    PIN_PC7

