SpenceKonde/DxCore/megaavr/extras/VariantTemplate.h
  /* On DxCore, don't put TCA PWM pins in here. They are found automatically. */
  /* When the errata is fixed, the same will be done for TCD */
  const uint8_t digital_pin_to_timer[] = {
    NOT_ON_TIMER, //  0 PA0/USART0_Tx/CLKIN
    NOT_ON_TIMER, //  1 PA1/USART0_Rx
    NOT_ON_TIMER, //  2 PA2/SDA
    NOT_ON_TIMER, //  3 PA3/SCL
    TIMERD0,      //  4 PA4/MOSI      WOA
    TIMERD0,      //  5 PA5/MISO      WOB
    TIMERD0,      //  6 PA6/SCK       WOC mirrors WOA
    TIMERD0,      //  7 PA7/SS/CLKOUT WOD mirrors WOB
    NOT_ON_TIMER, //  8 PB0
    NOT_ON_TIMER, //  9 PB1
    NOT_ON_TIMER, // 10 PB2
    NOT_ON_TIMER, // 11 PB3
    NOT_ON_TIMER, // 12 PB4
    NOT_ON_TIMER, // 13 PB5
    TIMERB2,      // 16 PC0
    TIMERB3,      // 17 PC1
    NOT_ON_TIMER, // 18 PC2
    NOT_ON_TIMER, // 19 PC3
    NOT_ON_TIMER, // 20 PC4
    NOT_ON_TIMER, // 21 PC5
    NOT_ON_TIMER, // 20 PC6
    NOT_ON_TIMER, // 21 PC7
    NOT_ON_TIMER, // 22 PD0/AIN0
    NOT_ON_TIMER, // 23 PD1/AIN1
    NOT_ON_TIMER, // 24 PD2/AIN2
    NOT_ON_TIMER, // 25 PD3/AIN3
    NOT_ON_TIMER, // 26 PD4/AIN4
    NOT_ON_TIMER, // 27 PD5/AIN5
    DACOUT,       // 28 PD6/AIN6
    NOT_ON_TIMER, // 29 PD7/AIN7/AREF
    NOT_ON_TIMER, // 30 PE0/AIN8
    NOT_ON_TIMER, // 31 PE1/AIN9
    NOT_ON_TIMER, // 32 PE2/AIN10
    NOT_ON_TIMER, // 33 PE3/AIN11
    NOT_ON_TIMER, // 34 PF0/USART2_Tx/TOSC1
    NOT_ON_TIMER, // 35 PF1/USART2_Rx/TOSC2
    NOT_ON_TIMER, // 36 PF2/AIN12
    NOT_ON_TIMER, // 37 PF3/AIN13
    TIMERB0,      // 38 PF4/AIN14
    TIMERB1,      // 39 PF5/AIN15
    NOT_ON_TIMER,  // 40 PF6 RESET
  //NOT_ON_TIMER, //  55 PF7 (UPDI)
  };

#endif

#endif
